{"author": {"name": "Blackjack: Rules", "icon_url": "https://cdn.discordapp.com/attachments/864673127068860476/864767073380597781/blackjack_icon_small_narrow.png"}, "fields": [{"inline": false, "name": "__Round Phases__", "value": "Phase 1: Betting\nPhase 2: Initial Deal\nPhase 3: Blackjack resolution\nPhase 4: Player Turns\nPhase 5: Dealer Turn\nPhase 6: Payout\n"}, {"inline": false, "name": "__Phase 1: Betting__", "value": "At the beginning of each round, all players place their bets."}, {"inline": false, "name": "__Phase 2: Initial Deal__", "value": "All players are dealt two cards face-up and the dealer receives two cards, one face-up and another face-down."}, {"inline": false, "name": "__Phase 3: Blackjack Resolution__", "value": "If you're dealt a 10 value card and an Ace as your first two cards that means you got a Blackjack.\n\n**Blackjack Resolution - No Dealer Blackjack:**\nYou are paid 1.5 times your wager immediately, without playing through the round\n\n**Blackjack Resolution - Dealer Blackjack:**\nYou don't win anything, your bet is returned to you."}, {"inline": false, "name": "__Phase 4: Player Turns__", "value": "Starting to the left of the dealer, each player is given a chance to draw more cards.The players can either 'hit' or 'stand'.\n\n**Player Turn - Hit:**\nIf the player calls out 'HIT', they are given an extra card. The player can 'HIT' as many times as they wish, but have to aim not to 'bust' (exceed a total of 21). If the player busts, they immediately lose their bet.\n\n**Player Turn - Stand:**\nThey can call 'STAND' if they do not wish to draw any more cards."}, {"inline": false, "name": "__Phase 5: Dealer Turn__", "value": "After each player has played and either stood or busted, the dealer takes their turn. The dealer, again, either 'HIT' or 'STAND', but must hit until their cards reach a total value of 17 or more.\n\n**Dealer Turn - Dealer Busts:**\nIf the dealer's hand exceeds 21, all players who didn't bust win immediately - their bet is returned along with a matching amount from the dealer's bank."}, {"inline": false, "name": "__Phase 6: Payout__", "value": "This phase is only reached if the dealer hasn't busted. Each player who hasn't busted compares their hand to the dealer's to determine their outcome. Each player's hand's cards are totalled and compared to the dealer's.\n\n**Payout - Player Wins:**\nPlayer's bet is returned along with a matching amount from the dealer's bank.\n\n**Payout - Player Loses:**\nPlayer loses their bet.\n\n**Payout - Player Ties:**\nPlayer's original bet is returned to the player."}, {"inline": false, "name": "__Card Values__", "value": "All number cards (2-10) score the value indicated on them. The face cards (Jack, Queen, King) score 10 points and Ace can either be treated as 1 or 11. A perfect hand combines an ace with a 10, Jack, Queen or King and is known as a 'Blackjack'."}], "color": 12648448, "type": "rich", "description": "Rules for the Blackjack that's currently implemented on this bot\n​"}